Revit 2024 API
MasonryCMU.MasonryCMUPatternHeight Property
 The property labeled "Amount" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MasonryCMUPatternHeight { get; }
Visual Basic
Public Shared ReadOnly Property MasonryCMUPatternHeight As String
	Get
Visual C++
public:
static property String^ MasonryCMUPatternHeight {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace